Recently, I was compelled by my own curiosity to study SQL, a language I have heard about quite a lot but never had a chance to study. At first, SQL sounded difficult and foreign largely because it was a language fundamentally different from other programming languages I had studied, such as Java, Python, or R. However, after watching this [fantastic video tutorial] on YouTube, and completing a relevant course on DataCamp, I think I now finally have a somewhat concrete understanding of what SQL is and how to use it. Of course, I'm still so far away from being fluent in SQL, and the queries I can write are still pretty basic. Much like the [blog post on R], this post will serve as a reference for myself, as well as serving the auxiliary role of introducing how one might set up a MySQL environment locally and integrate it with Jupyter Notebook. Let's dive right into it.

# SQL with Jupyter

To use SQL with Jupyter, it is necessary to install a few packages. The first on the list is `ipython-sql`, which allows us to use magic commands in Jupyter notebooks. To install, simply type the following line in the terminal, assuming that you have activated the conda virtual environment of choice. 

```bash
conda install ipython-sql
```

In [1]:
%load_ext sql

In [2]:
# Don't expose the password

%sql mysql+pymysql://root:Jakelake100493@localhost:3306/test

'Connected: root@test'

In [3]:
%sql SELECT * FROM employee ORDER BY sex, first_name, last_name LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/test
5 rows affected.

[(103, 'Angela', 'Martin', datetime.date(1971, 6, 25), 'F', 63000, 102, 2),
 (101, 'Jan', 'Levinson', datetime.date(1961, 5, 11), 'F', 110000, 100, 1),
 (104, 'Kelly', 'Kapoor', datetime.date(1980, 2, 5), 'F', 55000, 102, 2),
 (107, 'Andy', 'Bernard', datetime.date(1973, 7, 22), 'M', 65000, 106, 3),
 (100, 'David', 'Wallace', datetime.date(1967, 11, 17), 'M', 250000, None, 1)]

...
[fantastic video tutorial]: